# Negate Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
XYZ..::..Negate Method
XYZ Class See Also
---
Negates this vector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public XYZ Negate()
```

Visual Basic
---
```text
Public Function Negate As XYZ
```

Visual C++
---
```text
public:
XYZ^ Negate()
```

# ### Return Value
The vector opposite to this vector.
# Remarks
The negated vector is obtained by changing the sign of each coordinate of this vector.
# See Also
XYZ Class
Autodesk.Revit.DB Namespace